
const About = `# لعبة ٣٠ ثانية

٣٠ ثانية هي لعبة تلعب فيها لاكتساب المعرفة والمتعة.
> إنها لعبة جميلة للغاية للعب مع أصدقائك، ولكن أيضًا مع عائلتك.

## كيف تلعب ✌؟
أول شيئ، سيكون لديك خصم. يمكن أن يكون هناك فريقان أو أكثر في اللعبة.
بعد اختيارك للفرق، يمكنك البدء مباشرةً.

سيبدأ الوقت بمجرد النقر فوق "جاهز"، ثم سترى الأسئلة (الخيارات).
> إفتراضياً، الوقت مضبوظ على 30 ثانية، لكنه قابل للتعديل.

سيكون هناك العديد من الأسئلة (الاختيارات) التي سيتعين عليك أن تشرحها لزملائك في الفريق ما يعنيه كل واحد من هذه الأسئلة، وإذا كانت إجابتك صحيحة، فاضغط عليها لتحديد ما خمنت. بمجرد انتهاء الوقت، سترى شاشة النتائج ومن هو التالي.

### الفائز؟
بمجرد وصول الفريق إلى 30 نقطة ، يفوز.
> إفتراضياً، يجب أن يصل الفريق إلى 30 نقطة للفوز، لكن ذلك قابل للتعديل.

-----------------------------


## القواعد ◕‿↼
يطلق على اللاعبين الواصِفين والمُعرفين. يجب على جميع اللاعبين أن يأخذوا دورهم في أن يكونوا كلاً من الواصِفين والمعرفين. يجب أن يدور دور الواصف داخل الفريق مع كل دور.

1. يمكن وصف أي مصطلح من خلال:
    - وصف الأسماء بأي طريقة, بما في ذلك الغناء والطنين والإيماء
    -  وصف الأسماء بأي ترتيب
    -  باستخدام الكلمات "و" و "ال" التي تظهر في بعض الأسماء.

2. وصف أي مصطلح لا يمكن أن يكون من خلال:
    -  قول الأسماء الفعلية للمصطلحات المعروضة.
    -  قول أي أسماء أو كلمات مشتقة من أو تتعلق بالأسماء التي يصفونها.
    -  باستخدام أي تكتيكات "تشبه الأصوات" أو "القوافي".
    -  قول أو الإشارة إلى الحروف الأبجدية.
    -  استخدام الترجمات.
    -  الإشارة إلى الأشياء

-----------------------------


## أشياء مفقودة ʘ‿ʘ

هل ترغب في رؤية شيء جديد في هذه اللعبة (¬‿¬)؟

** ثم لا تتردد في التواصل معي ** 凸 (͡ ° ͜ʖ ͡ °) 凸

[أرسل لي بريدًا إلكترونيًا](mailto:hasansh343@gmail.com)


-----------------------------


## صنع مع ℒℴνℯ

هل تريد المساهمة؟ [github](https://github.com/hasan-sh/30s/issues) :)

-----------------------------`;
export default About;