import React, { useContext } from 'react';
import { View, StyleSheet, ScrollView } from 'react-native';
import MarkDown from 'react-native-markdown-renderer';

import { Context } from '../state';
import About from '../About';

const AboutScreen = () => {
    const [{ time, questionLimit }, { setTime, setQuestionLimit }] = useContext(
        Context,
    );

    return (
        <ScrollView style={{padding: 5}}>
            <MarkDown style={markdownStyles}>{About}</MarkDown>
        </ScrollView>
    );
};

export default AboutScreen;

const markdownStyles = StyleSheet.create({
    // heading1: {
    //     fontSize: 24,
    //     color: 'purple',
    // },
    // link: {
    //     color: 'pink',
    // },
    // mailTo: {
    //     color: 'orange',
    // },
    text: {
        color: '#555555',
        fontSize: 18,
    },
    heading: {
        borderBottomWidth: 1,
        borderColor: '#000000',
    },
    heading1: {
        fontSize: 32,
        // color: '#000',
        color: 'purple',
        margin: 10,
    },
    heading2: {
        fontSize: 24,
        margin: 10,
    },
});
// <MarkDown styles={markdownStyles}>
{
    /* # ٣٠ ثانية {'\n\n'}

       ٣٠ ثانية هي لعبة تلعب فيها لاكتساب المعرفة والمتعة.
        > إنها لعبة جميلة للغاية للعب مع أصدقائك ، ولكن أيضًا مع عائلتك. {'\n\n'}

        ## كيف تلعب ✌؟{'\n\n'}
        أول شيئ، سيكون لديك خصم. يمكن أن يكون هناك فريقان أو أكثر في اللعبة.
        بعد اختيارك للفرق ، يمكنك البدء مباشرةً. {'\n\n'}


        سيبدأ الوقت بمجرد النقر فوق "جاهز" ، ثم سترى الأسئلة (الخيارات).
        > إفتراضياً، الوقت مضبوظ على 30 ثانية ، لكنه قابل للتعديل. {'\n\n'}

        سيكون هناك العديد من الأسئلة (الاختيارات) التي سيتعين عليك أن تشرح لزملائك في الفريق ما يعنيه كل واحد من هذه الأسئلة ، وإذا كان صحيحًا ، فاضغط عليها لتحديد ما خمنت. بمجرد انتهاء الوقت ، سترى شاشة النتائج ومن هو التالي. {'\n\n'}

        ### الفائز؟ {'\n\n'}
        بمجرد وصول الفريق إلى 30 نقطة ، يفوز.
        > إفتراضياً، يجب أن يصل الفريق إلى 30 نقطة للفوز ، لكن ذلك قابل للتعديل. {'\n\n'}

        -----------------------------{'\n\n'}

        ## القواعد ◕‿↼{'\n\n'}
        يطلق على اللاعبين الواصِفين والمُعرفين. يجب على جميع اللاعبين أن يأخذوا دورهم في أن يكونوا كلاً من الواصِفين والمعرفين. يجب أن يدور دور الواصف داخل الفريق مع كل دور.{'\n\n'}

        1. يمكن وصف أي مصطلح من خلال:
            - وصف الأسماء بأي طريقة, بما في ذلك الغناء والطنين والإيماء
            -  وصف الأسماء بأي ترتيب
            -  باستخدام الكلمات "و" و "ال" التي تظهر في بعض الأسماء.

        2. وصف أي مصطلح لا يمكن أن يكون من خلال:
            -  قول الأسماء الفعلية للمصطلحات المعروضة.
            -  قول أي أسماء أو كلمات مشتقة من أو تتعلق بالأسماء التي يصفونها.
            -  باستخدام أي تكتيكات "تشبه الأصوات" أو "القوافي".
            -  قول أو الإشارة إلى الحروف الأبجدية.
            -  استخدام الترجمات.
            -  الإشارة إلى الأشياء

        -----------------------------
        </MarkDown> */
}
